EdwinKestler/NFC_MFR522_ESP8266_MQTT/src/main.cpp

/*
  Created by Edwin Kestler, & Dennis Revolorio sept 07 , 2018.
  @flatbox Guatemala Centro America.
  Released into the public domain under GPLv3.
*/

#include <Arduino.h>
// Librerias de ESP // MQTT/ JSON FORMAT data
#include <ESP8266WiFi.h>                                              //Libreira de ESPCORE ARDUINO
#include <PubSubClient.h>                                             //https://github.com/knolleary/pubsubclient/releases/tag/v2.3
#include <ArduinoJson.h>                                              //https://github.com/bblanchon/ArduinoJson/releases/tag/v5.0.7
//----------------------------------------------------------------------librerias de TIEMPO NTP
#include <TimeLibEsp.h>                                                  //TimeTracking
#include <WiFiUdp.h>                                                  //UDP packet handling for NTP request
//----------------------------------------------------------------------Librerias de manejo de setup de redes 
#include <ESP8266WebServer.h>                                         //Libreira de html para ESP8266
#include <DNSServer.h>                                                //Libreria de DNS para resolucion de Nombres
#include <WiFiManager.h>                                              //https://github.com/tzapu/WiFiManager
//----------------------------------------------------------------------Librerias de Codigo de Lectora RFID
#include <SoftwareSerial.h>
#include "settings.h"
//----------------------------------------------------------------------Libreria locales de clases de botron y LEDS
#include <BlinkRGB.h>
//---------------------------------------------------------------------------------RGB Settings
BlinkRGB Azul (D6);
BlinkRGB Verde (D7);
BlinkRGB Rojo (D8);

BlinkColor Blanco  (D6,D7,D8);
BlinkColor Purpura (D6,D4,D8);

//----------------------------------------------------------------------------------Buzzer Settings
const int beep = D5;
//----------------------------------------------------------------------------------RFID Settings
String Analisis = "";
String CARD_ID = "";
String LAST_ID = "";
bool RECORD=LOW;
SoftwareSerial SSDEBUG(D1, D2, false, 256); // Rx, Tx
//----------------------------------------------------------------------------------json Data
String msg = "";
int WifiSignal;
//----------------------------------------------------------------------Poner el Pin de ADC en modo de sensar el voltaje da la bateria
int AnalogVCCPin = A0;                                              //Se opne el pin A0 en modo de Lectura interna 1.8V
float VBat = 0;
boolean BatWarningSent = false;
boolean flashWarning = false;
//----------------------------------------------------------------------Variables de verificacion de fallas de capa de conexion con servicio
int failed, sent, published;                                          //Variables de conteo de envios 
int BeepBatteryWarning = 0;
int BeepSignalWarning =0;
//------------------------------------------------------------------------------------FSM Settings
#define STATE_IDLE                    0
#define STATE_TRANSMIT_CARD_DATA      1
#define STATE_UPDATE                  2
#define STATE_TRANSMIT_ALARM_UPDATE   3
#define STATE_TRANSMIT_DEVICE_UPDATE  4
#define STATE_UPDATE_TIME             5
int fsm_state;
//----------------------------------------------------------------------Inicio de cliente UDP
WiFiUDP udp;                                                          //Cliente UDP para WIFI
//----------------------------------------------------------------------Codigo para estblecer el protocolo de tiempo en red NTP
const int NTP_PACKET_SIZE = 48;                                       //NTP time is in the first 48 bytes of message
byte packetBuffer[NTP_PACKET_SIZE];                                   //Buffer to hold incoming & outgoing packets
boolean NTP = false;                                                  //Bandera que establece el estado inicial del valor de NTP
//----------------------------------------------------------------------Variables del servicio de envio de datos MQTT
const char* cserver = "";
//char authMethod[] = "use-token-auth";                                 //Tipo de Autenticacion para el servicio de Bluemix (la calve es unica por cada nodo)
//char token[] = TOKEN;                                                 //Variable donde se almacena el Token provisto por el servicio (ver Settings.h)
char clientId[] = "d:" ORG ":" DEVICE_TYPE ":" DEVICE_ID;             //Variable de Identificacion de Cliente para servicio de MQTT Bluemix 
String  Smacaddrs = "00:00:00:00:00:00";
String  Sipaddrs  = "000.000.000.000";
//----------------------------------------------------------------------Declaracion de Variables Globales (procuar que sean las minimas requeridas.)
unsigned long lastUPDATEMillis;                                       //Variable para llevar conteo del tiempo desde la ultima publicacion 
unsigned long lastwarning;                                         //Variable para llevar conteo del tiempo desde la ultima publicacion 
unsigned long lastNResetMillis;                                       //Variable para llevar conteo del tiempo desde la ultima publicacion
unsigned long Check_connection_mqtt;                                                                    //Variable donde se define cada cuanto se chequea conecion conel servidor de mqtt 
String ISO8601;                                                       //Variable para almacenar la marca del timepo (timestamp) de acuerdo al formtao ISO8601
int hora = 0;
//----------------------------------------------------------------------definir Parametros de Lector de RFID
unsigned long RetardoLectura;
String OldTagRead = "1";                                                    //VAriable para guardar la ultima tag leida y evitar lecturas consecutivas
String inputString;

//----------------------------------------------------------------------Variables Para el boton de emergencia
int IdEventoT= 0;
//----------------------------------------------------------------------Variables Propias del CORE ESP8266 Para la administracion del Modulo
String NodeID = String(ESP.getChipId());                              //Variable Global que contiene la identidad del nodo (ChipID) o numero unico
//------------------------------------------------------------------------------------denifinir el sonido de bocina
void buzzer() {
  digitalWrite(beep, HIGH);
  delay(300);
  digitalWrite(beep, LOW);
  delay(100);
}
//----------------------------------------------------------------------Funcion remota para administrar las actulizaciones remotas de las variables configurables desde IBMbluemix
void handleUpdate(byte* payload) {                                    //La Funcion recibe lo que obtenga Payload de la Funcion Callback que vigila el Topico de subcripcion (Subscribe TOPIC)
    StaticJsonBuffer<300> jsonBuffer;                                  //Se establece un Buffer de 1o suficientemente gande para almacenar los menasajes JSON
    JsonObject& root = jsonBuffer.parseObject((char*)payload);          //Se busca la raiz del mensaje Json convirtiendo los Bytes del Payload a Caracteres en el buffer
    if (!root.success()) {                                              //Si no se encuentra el objeto Raiz del Json
        SSDEBUG.println(F("ERROR en la Letura del JSON Entrante"));        //Se imprime un mensaje de Error en la lectura del JSON
        return;                                                           //Nos salimos de la funcion
    }                                                                //se cierra el condicional
    SSDEBUG.println(F("handleUpdate payload:"));                         //si se pudo encontrar la raiz del objeto JSON se imprime u mensje
    root.prettyPrintTo(Serial);                                         //y se imprime el mensaje recibido al Serial  
    SSDEBUG.println();                                                   //dejamos una linea de pormedio para continuar con los mensajes de debugging
}
//----------------------------------------------------------------------Funcion remota para mandar a dormir el esp despues de enviar un RFID
void handleResponse (byte* payloadrsp) {
    StaticJsonBuffer<200> jsonBuffer;                                   //Se establece un Buffer de 1o suficientemente gande para almacenar los menasajes JSON
    JsonObject& root = jsonBuffer.parseObject((char*)payloadrsp);       //Se busca la raiz del mensaje Json convirtiendo los Bytes del Payload a Caracteres en el buffer
    if (!root.success()) {                                                                              //Si no se encuentra el objeto Raiz del Json
        SSDEBUG.println(F("ERROR en la Letura del JSON Entrante"));        //Se imprime un mensaje de Error en la lectura del JSON
        return;                                                           //Nos salimos de la funcion
    }                                                                   //se cierra el condicional

    SSDEBUG.println(F("handleResponse payload:"));                       //si se pudo encontrar la raiz del objeto JSON se imprime u mensje
    root.printTo(Serial);                                         //y se imprime el mensaje recibido al Serial  
    SSDEBUG.println();                                                   //dejamos una linea de pormedio para continuar con los mensajes de debugging
}
//----------------------------------------------------------------------Funcion de vigilancia sobre mensajeria remota desde el servicion de IBM bluemix
void callback(char* topic, byte* payload, unsigned int payloadLength){//Esta Funcion vigila los mensajes que se reciben por medio de los Topicos de respuesta;
    SSDEBUG.print(F("callback invoked for topic: "));                    //Imprimir un mensaje seÃ±alando sobre que topico se recibio un mensaje
    SSDEBUG.println(topic);                                              //Imprimir el Topico
  
    if (strcmp (responseTopic, topic) == 0) {                            //verificar si el topico conicide con el Topico responseTopic[] definido en el archivo settings.h local
        handleResponse(payload);
        //return; // just print of response for now                         //Hacer algo si conicide (o en este caso hacer nada)
    }
    
