EdwinKestler/NFC_MFR522_ESP8266_MQTT/src/main.cpp
    if (strcmp (rebootTopic, topic) == 0) {                             //verificar si el topico conicide con el Topico rebootTopic[] definido en el archivo settings.h local
    SSDEBUG.println(F("Rebooting..."));                                //imprimir mensaje de Aviso sobre reinicio remoto de unidad.
    ESP.reset();                                                    //Emitir comando de reinicio para ESP8266
    }

    if (strcmp (updateTopic, topic) == 0) {                             //verificar si el topico conicide con el Topico updateTopic[] definido en el archivo settings.h local
    handleUpdate(payload);                                            //enviar a la funcion handleUpdate el contenido del mensaje para su parseo.
    }
}
//----------------------------------------------------------------------definicion de Cliente WIFI para ESP8266 y cliente de publicacion y subcripcion
WiFiClient wifiClient;                                                //Se establece el Cliente Wifi
PubSubClient client(MQTTServer, 1883, callback, wifiClient);              //se establece el Cliente para el servicio MQTT
//----------------------------------------------------------------------Funcion de Conexion a Servicio de MQTT
void mqttConnect() {
  if (!!!client.connected()) {                                         //Verificar si el cliente se encunetra conectado al servicio
  SSDEBUG.print(F("Reconnecting MQTT client to: "));                    //Si no se encuentra conectado imprimir un mensake de error y de reconexion al servicio
  SSDEBUG.println(MQTTServer);                                             //Imprimir la direccion del servidor a donde se esta intentado conectar 
  char charBuf[30];
  String CID (clientId + NodeID); 
  CID.toCharArray(charBuf, 30);  
  #if defined (internetS)
    while (!!!client.connect(charBuf, "flatboxadmin", "FBx_admin2012")) {                                //Si no se encuentra conectado al servicio intentar la conexion con las credenciales Clientid, Metodo de autenticacion y el Tokeno password
    SSDEBUG.print(F("."));                                             //imprimir una serie de puntos mientras se da la conexion al servicio
    Blanco.CFlash();
    }  
  #else
    while (!!!client.connect(charBuf)) {                                //Si no se encuentra conectado al servicio intentar la conexion con las credenciales Clientid, Metodo de autenticacion y el Tokeno password
    SSDEBUG.print(F("."));                                             //imprimir una serie de puntos mientras se da la conexion al servicio
    Blanco.CFlash();
    }  
  #endif  
  SSDEBUG.println();                                                   //dejar un espacio en la terminal para diferenciar los mensajes.
 }
}

//----------------------------------------------------------------------Funcion de REConexion a Servicio de MQTT
void MQTTreconnect() {
  int retry = 0;
  // Loop until we're reconnected
  while (!client.connected()) {    
    SSDEBUG.print(F("Attempting MQTT connection..."));
    Blanco.CFlash();
    buzzer();
    char charBuf[30];
    String CID (clientId + NodeID);
    CID.toCharArray(charBuf, 30);  
     #if defined (internetS)
     if (client.connect(charBuf, "flatboxadmin", "FBx_admin2012")) {
      SSDEBUG.println(F("connected"));
     }
     #else
     if (client.connect(charBuf)) {
      SSDEBUG.println(F("connected"));
     }
     #endif
     else {
      Purpura.CFlash();
      buzzer();
      SSDEBUG.print(F("failed, rc="));
      SSDEBUG.print(client.state());
      SSDEBUG.print(F(" try again in 3 seconds,"));
      SSDEBUG.print(F(" retry #:"));
      SSDEBUG.println(retry);
      if (retry > 10){
        ESP.restart();
        retry=0;
      }
      retry++;
      // Wait 3 seconds before retrying
      delay(3000);
    }
  }
}

//----------------------------------------------------------------------Funcion encargada de subscribir el nodo a los servicio de administracion remota y de notificar los para metros configurables al mismo
void initManagedDevice() {
  if (client.subscribe("iotdm-1/response")) {                         //Subscribir el nodo al servicio de mensajeria de respuesta
    SSDEBUG.println(F("subscribe to responses OK"));                   //si se logro la sibscripcion entonces imprimir un mensaje de exito
  }
  else {
    SSDEBUG.println(F("subscribe to responses FAILED"));               //Si no se logra la subcripcion imprimir un mensaje de error
  }
  
  if (client.subscribe(rebootTopic)) {                                //Subscribir el nodo al servicio de mensajeria de reinicio remoto
    SSDEBUG.println(F("subscribe to reboot OK"));                      //si se logro la sibscripcion entonces imprimir un mensaje de exito
  }
  else {
    SSDEBUG.println(F("subscribe to reboot FAILED"));                  //Si no se logra la subcripcion imprimir un mensaje de error                
  }
  
  if (client.subscribe("iotdm-1/device/update")) {                    //Subscribir el nodo al servicio de mensajeria de reinicio remoto
    SSDEBUG.println(F("subscribe to update OK"));                      //si se logro la sibscripcion entonces imprimir un mensaje de exito
  }
  else {
    SSDEBUG.println(F("subscribe to update FAILED"));                  //Si no se logra la subcripcion imprimir un mensaje de error         
  }
  
  StaticJsonBuffer<500> jsonBuffer;
  JsonObject& root = jsonBuffer.createObject();
  JsonObject& d = root.createNestedObject("d");
  JsonObject& metadata = d.createNestedObject("metadata");
  metadata["UInterval"] = UInterval;
  metadata["UPDATETIME"] = 60*UInterval;
  metadata["NResetTIME"] = 60*60*UInterval;
  metadata["timeZone"] = timeZone;    
  JsonObject& supports = d.createNestedObject("supports");
  supports["deviceActions"] = true;  
  JsonObject& deviceInfo = d.createNestedObject("deviceInfo");
  deviceInfo["ntpServerName"] = ntpServerName;
  deviceInfo["server"] = MQTTServer;
  deviceInfo["MacAddress"] = Smacaddrs;
  deviceInfo["IPAddress"]= Sipaddrs;    
  char buff[500];
  root.printTo(buff, sizeof(buff));
  SSDEBUG.println(F("publishing device manageTopic metadata:"));
  SSDEBUG.println(buff);
  sent++;
  if (client.publish(manageTopic, buff)) {
    SSDEBUG.println(F("device Publish ok"));
  }else {
    SSDEBUG.println(F("device Publish failed:"));
  }
}

//----------------------------------------------------------------------send an NTP request to the time server at the given address
void sendNTPpacket(IPAddress &address)
{
  // set all bytes in the buffer to 0
  memset(packetBuffer, 0, NTP_PACKET_SIZE);
  // Initialize values needed to form NTP request
  // (see URL above for details on the packets)
  packetBuffer[0] = 0b11100011;   // LI, Version, Mode
  packetBuffer[1] = 0;     // Stratum, or type of clock
  packetBuffer[2] = 6;     // Polling Interval
  packetBuffer[3] = 0xEC;  // Peer Clock Precision
  // 8 bytes of zero for Root Delay & Root Dispersion
  packetBuffer[12]  = 49;
  packetBuffer[13]  = 0x4E;
  packetBuffer[14]  = 49;
  packetBuffer[15]  = 52;
  // all NTP fields have been given values, now
  // you can send a packet requesting a timestamp:                 
  udp.beginPacket(address, 123); //NTP requests are to port 123
  udp.write(packetBuffer, NTP_PACKET_SIZE);
  udp.endPacket();
}

//----------------------------------------------------------------------Funcion para obtener el paquee de TP y procesasr la fecha hora desde el servidor de NTP
time_t getNtpTime(){
  while (udp.parsePacket() > 0) ; // discard any previously received packets
  SSDEBUG.println(F("Transmit NTP Request"));
  sendNTPpacket(timeServer);
  uint32_t beginWait = millis();
  while (millis() - beginWait < 1500) {
    int size = udp.parsePacket();
    if (size >= NTP_PACKET_SIZE) {
      SSDEBUG.println(F("Receive NTP Response"));
      NTP = true;
      udp.read(packetBuffer, NTP_PACKET_SIZE);  // read packet into the buffer
      unsigned long secsSince1900;
      // convert four bytes starting at location 40 to a long integer
      secsSince1900 =  (unsigned long)packetBuffer[40] << 24;
      secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
      secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
      secsSince1900 |= (unsigned long)packetBuffer[43];
      return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
    }
  }
  SSDEBUG.println(F("No NTP Response :-("));
  return 0; // return 0 if unable to get the time
}


//----------------------------------------------------------------------anager function. Configure the wifi connection if not connect put in mode AP--------//
void wifimanager() {
  WiFiManager wifiManager;
  SSDEBUG.println(F("empezando"));
  Purpura.COn();
  if (!  wifiManager.autoConnect("flatwifi")) {
    Purpura.CFlash();
    if (!wifiManager.startConfigPortal("flatwifi")) {
      //reset and try again, or maybe put it to deep sleep
      ESP.reset();
      delay(5 * UInterval);
    }
  }
}

//----------------------------------------------------------------------anager function. Configure the wifi connection if not connect put in mode AP--------//
void OnDemandWifimanager() {
  WiFiManager wifiManager;
  SSDEBUG.println(F("Empezando Configuracion de WIFI Bajo Demanda"));
  Purpura.COn();
  if (!wifiManager.startConfigPortal("flatwifi")) {
    //reset and try again, or maybe put it to deep sleep
    ESP.reset();
    delay(5 * UInterval);
  }
}
//-----------------------------------------------------------------------------------Setting up ESP8266 scketch
void setup() {
  pinMode(beep, OUTPUT);
  digitalWrite(beep, LOW);
  Blanco.COff();
  SSDEBUG.begin(9600);
  Serial.begin(115200);
  SSDEBUG.println(F("")); 
  SSDEBUG.println(F("Inicializacion de programa de boton con identificacion RFID;"));
  SSDEBUG.println(F("Parametros de ambiente de funcionamiento:"));
  SSDEBUG.print(F("            CHIPID: "));
  SSDEBUG.println(NodeID);
  SSDEBUG.print(F("            HARDWARE: "));
  SSDEBUG.println(HardwareVersion);
  SSDEBUG.print(F("            FIRMWARE: "));
  SSDEBUG.println(FirmwareVersion);
  SSDEBUG.print(F("            Servidor de NTP: "));
  SSDEBUG.println(ntpServerName);
  SSDEBUG.print(F("            Servidor de MQTT: "));
  SSDEBUG.println(MQTTServer);
  SSDEBUG.print(F("            Client ID: "));
  SSDEBUG.println(clientId); 
  delay(UInterval); 
  //--------------------------------------------------------------------------Configuracion Automatica de Wifi   
  while (WiFi.status() != WL_CONNECTED) {                                   //conectamos al wifi si no hay la rutina iniciara una pagina web de configuracion en la direccion 192.168.4.1 
    wifimanager();
    delay(UInterval);
  }
  SSDEBUG.print(F("Wifi conectado, Direccion de IP Asignado: "));
  SSDEBUG.println(WiFi.localIP());
  Sipaddrs = WiFi.localIP().toString();
  SSDEBUG.print(F("Direccion de MAC Asignado: "));
  SSDEBUG.println(WiFi.macAddress());
  Smacaddrs = String(WiFi.macAddress());
  SSDEBUG.println(F(""));                                                         //dejamos una linea en blanco en la terminal 
  //una vez contados al Wifi nos aseguramos tener la hora correcta simepre
  SSDEBUG.println(F("Connected to WiFi, sincronizando con el NTP;"));                    //mensaje de depuracion para saber que se intentara obtner la hora
  //--------------------------------------------------------------------------Configuracion de NTP
  SSDEBUG.print(F("servidor de NTP:"));
  SSDEBUG.println(ntpServerName);
  //--------------------------------------------------------------------------Configuracion de UDP
  SSDEBUG.println("Starting UDP");
  udp.begin(localPort);
  SSDEBUG.print("Local port: ");
  SSDEBUG.println(udp.localPort());
  while (NTP == false) {
    setSyncProvider(getNtpTime);                                                          //iniciamos la mensajeria de UDP para consultar la hora en el servicio de NTP remoto (el servidor se configura en 
    delay(UInterval);
  }
  NTP = false;
  //--------------------------------------------------------------------------Connectando a servicio de MQTT
  SSDEBUG.println(F("Time Sync, Connecting to mqtt sevrer"));
  mqttConnect();                                                            //Conectamos al servicio de Mqtt con las credenciales provistas en el archivo "settings.h"
  SSDEBUG.println(F("Mqtt Connection Done!, sending Device Data"));
  //--------------------------------------------------------------------------Enviando datos de primera conexion
  initManagedDevice();                                                      //inciamos la administracion remota desde Bluemix
  SSDEBUG.println(F("Finalizing Setup"));                                    //enviamos un mensaje de depuracion
  Blanco.COff();
  fsm_state = STATE_IDLE; //inciar el estado del la maquina de stado finito
  //*****************************************************************************************************Iniciar la Lectora en modo de TEST******************************
   Serial.write(0x02);
   //****************************************************************************************************Yield para que el ESP haga lo que tiene en cola de hacer********
  yield();
}

//-------- Data de Manejo RF_ID_Manejo. Publish the data to MQTT server, the payload should not be bigger than 45 characters name field and data field counts. --------//
void publishRF_ID_Manejo (String IDModulo,String MSG,float vValue,int RSSIV, int env, int fail,String Tstamp, String SMacAd, String SIpAd){
  StaticJsonBuffer<300> jsonBuffer;
  JsonObject& root = jsonBuffer.createObject();
  JsonObject& d = root.createNestedObject("d");
  JsonObject& Ddata = d.createNestedObject("Ddata");
  Ddata["ChipID"] = IDModulo;
  Ddata["Msg"] = MSG;
  Ddata["batt"] = vValue;
  Ddata["RSSI"] = RSSIV;
  Ddata["publicados"] = env;
  Ddata["enviados"] = sent;
  Ddata["fallidos"] = fail;
  Ddata["Tstamp"] = Tstamp;
  Ddata["Mac"] = SMacAd;
  Ddata["Ip"] = SIpAd;
  char MqttDevicedata[300];
  root.printTo(MqttDevicedata, sizeof(MqttDevicedata));
  SSDEBUG.println(F("publishing device data to manageTopic:"));
  SSDEBUG.println(MqttDevicedata);
  sent++;
  if (client.publish(manageTopic, MqttDevicedata)) {
     SSDEBUG.println(F("enviado data de dispositivo:OK"));
     published ++;
     failed = 0; 
  }else {
    SSDEBUG.print(F("enviado data de dispositivo:FAILED"));
    failed ++;
  }
}
//------------------------------------------------------------------------------------Leer la tarjeta que se presenta
void readTag() {
  if( Serial.available()){
    Serial.write(0x02);
    char T = Serial.read();
    if ((T != '\n') && (RECORD)) {
      CARD_ID += T;
    }
    if ((T == '\n') && (RECORD)) {
      RECORD = LOW;
      if(LAST_ID!=CARD_ID){
        SSDEBUG.println(CARD_ID);
      }
      Serial.write(0x7f);
      delay(50);
      Serial.write(0x0c);
      delay(50);
      Serial.write(0xf7);
      delay(100);
      inputString = CARD_ID;
      Azul.Flash();
      LAST_ID = CARD_ID;
      CARD_ID = "";
      fsm_state = STATE_TRANSMIT_CARD_DATA;
    }

    Analisis += T;
    int ID = Analisis.lastIndexOf("Series Number:");
    if(ID!=-1){
      Analisis = "";
      RECORD = HIGH;
    }
  }
  
  return;
}

//--------------------------------------------------------------------------Funcion de Verificacion de bateria------------------------------------------------------------------------------
float Bateria(){
 //int sensorValue = 4.2; //analogRead(AnalogVCCPin);
 //float volt = sensorValue;
 float volt = 821.14;
 volt = volt / 221.93;
 return volt;
}
//--------------------------------------------------------------------------------------Parsear la informacion de la tartjeta leida. (opcional)

