EdwinKestler/NFC_MFR522_ESP8266_MQTT/src/main.cpp
//------------------------------------------------------------------------------------------------Funcion de reseteo normal
void NormalReset(){
  if (millis()- lastNResetMillis > 60 * 60 * UInterval){
    hora++;
    WifiSignal = WiFi.RSSI();
    if (hora > 24){
      msg = ("24h NReset");  
      VBat = 4.2; //Bateria();
      publishRF_ID_Manejo(NodeID, msg, VBat, WifiSignal, published, failed, ISO8601, Smacaddrs, Sipaddrs);        //publishRF_ID_Manejo (String IDModulo,String MSG,float vValue, int fail,String Tstamp)
      void disconnect ();
      hora = 0;
      ESP.restart();
    }
    lastNResetMillis = millis(); //Actulizar la ultima hora de envio
  }
}
//--------------------------------------------------------------------------Funcion de checkear alarmas.!!!------------------------------------------------------------------------------
void checkalarms (){
      if (WiFi.RSSI() < -85){
        if(BeepSignalWarning < 4){
          buzzer();
          BeepSignalWarning++;
        }
        Blanco.CFlash();
      }
      BeepSignalWarning = 0;
  }

//--------------------------------------------------------------------------Funcion dealarmas locales Flash luces y bocina!!!------------------------------------------------------------------------------
void LocalWarning (){
     if (millis()- lastwarning > UInterval){
      lastwarning =millis();
      if (flashWarning == true){
        Rojo.Flash();
        if(BeepBatteryWarning < 4){
        buzzer();
        BeepBatteryWarning ++;
        }
        }else{
          if (Bateria() > BATTRESHHOLD ){
            BatWarningSent = true;
            flashWarning = false;
            BeepBatteryWarning = 0;
          }
        }
     }
  }      

//--------------------------------------------------------------------------Funcion de publicar los datos de estado si ha pasado el tiempo establecido entonces*!!------------------------------------------------------------------------------
void updateDeviceInfo(){
  msg = ("on");
  VBat = Bateria();
  WifiSignal = WiFi.RSSI();
  if (WiFi.RSSI() < -75){
    msg = ("LOWiFi");
    Rojo.Flash();
    buzzer();
    SSDEBUG.print(WiFi.SSID());
    SSDEBUG.print(" ");
    SSDEBUG.println(WiFi.RSSI());
    fsm_state = STATE_TRANSMIT_ALARM_UPDATE; //publishRF_ID_Manejo(NodeID, msg, VBat, WifiSignal, published, failed, ISO8601, Smacaddrs, Sipaddrs);        //publishRF_ID_Manejo (String IDModulo,String MSG,float vValue, int fail,String Tstamp)
    return;
  }
  if (Bateria() < BATTRESHHOLD ){
    flashWarning = true;
    buzzer();
    msg = ("LowBat");
    if (BatWarningSent == false){
      fsm_state = STATE_TRANSMIT_ALARM_UPDATE; //publishRF_ID_Manejo(NodeID, msg, VBat, WifiSignal, published, failed, ISO8601, Smacaddrs, Sipaddrs);
      BatWarningSent = true;
    }
    return;
  }
  if (Bateria() > BATTRESHHOLD ){
    BatWarningSent = true;
    flashWarning = false;
  }
 }

//----------------------------------------------------------------------------funcion que procesa como desplegar y transmitir la hora de acuerdo al formato del ISO8601
void CheckTime(){ //digital clock display of the time
  time_t prevDisplay = 0; 
  if (timeStatus() != timeNotSet) {
    if (now() != prevDisplay) {                                             //update the display only if time has changed
      prevDisplay = now();
      ISO8601 = String (year(), DEC);
      ISO8601 += "-";
      ISO8601 += month();
      ISO8601 += "-";
      ISO8601 += day();
      ISO8601 +="T";
      if ((hour() >= 0)&& (hour() < 10)){
        //SSDEBUG.print(F("+0:"));
        //SSDEBUG.println(hour());
        ISO8601 +="0";
        ISO8601 += hour();
      }else{
        //SSDEBUG.print(F("hora:"));
        //SSDEBUG.println(hour());
        ISO8601 += hour();
      }
      ISO8601 += ":";
      ISO8601 += minute();
      ISO8601 += ":";
      ISO8601 += second();
    }
  }
}

//-------- funcion datos Lectura Tag RF_ID_LECTURA. Publish the data to MQTT server, the payload should not be bigger than 45 characters name field and data field counts. --------//
void publishRF_ID_Lectura(String IDModulo, String Tstamp, String tagread) {
  if (OldTagRead != tagread){
    OldTagRead = tagread;
    IdEventoT ++;
    String IDEventoT = String (NodeID + IdEventoT);
    StaticJsonBuffer<250> jsonBuffer;
    JsonObject& root = jsonBuffer.createObject();
    JsonObject& d = root.createNestedObject("d");
    JsonObject& tagdata = d.createNestedObject("tagdata");
    tagdata["ChipID"] = IDModulo;
    tagdata["IDeventoTag"]= IDEventoT;
    tagdata["Tstamp"] = Tstamp;
    tagdata["Tag"] = tagread;
    char MqttTagdata[250];
    root.printTo(MqttTagdata, sizeof(MqttTagdata));
    SSDEBUG.println(F("publishing Tag data to publishTopic:")); 
    SSDEBUG.println(MqttTagdata);
    sent ++;
    if (client.publish(publishTopic, MqttTagdata)){
      SSDEBUG.println(F("enviado data de RFID: OK"));
      Verde.Flash();
      buzzer();
      published ++;
      inputString = "";
      failed = 0; 
      }else {
        SSDEBUG.println(F("enviado data de RFID: FAILED"));
        Rojo.Flash();
        failed ++;
        OldTagRead = "1";
        inputString = "";
      }
  }else{
    SSDEBUG.println("Este es una lectura consecutiva");
  }
}

//*******************************************************************************************************VOID LOOP*******************************************************
void loop() {
  
    switch(fsm_state){                                                                                  // inciar el casw switch
    case STATE_IDLE: // hacer cuando el estado sea IDLE
    readTag(); //leer su hay alguna tarjeta
    NormalReset();
    checkalarms();
    LocalWarning ();
    if(millis() - lastUPDATEMillis > 30*60*UInterval) {
        lastUPDATEMillis = millis(); //Actulizar la ultima hora de envio
        fsm_state = STATE_UPDATE;
    }
    
    if(millis() - lastUPDATEMillis > 60*60*UInterval) {
        lastUPDATEMillis = millis(); //Actulizar la ultima hora de envio
        fsm_state = STATE_UPDATE_TIME;
    }
    
    if ( millis() - RetardoLectura > 5 * UInterval){
        OldTagRead = "1";
        RetardoLectura = millis(); //Actulizar la ultima hora de envio
    }
    // VERIFICAMOS CUANTAS VECES NO SE HAN ENVIOADO PAQUETES (ERRORES)
    if (failed >= FAILTRESHOLD){
        failed =0;
        published =0;
        sent=0;    
        ESP.restart();
    }

     if ( millis() - Check_connection_mqtt > 5 * UInterval){
       Check_connection_mqtt = millis();
       //verificar que el cliente de Conexion al servicio se encuentre conectado
       if (!client.connected()) {
         MQTTreconnect();
       }
       client.loop();
     }
     
    break;
    //**************************************************************************************************STATE_TRANSMIT_CARD_DATA*****************************************
    case STATE_TRANSMIT_CARD_DATA:
    //Build the Json
    //check connection
    //Send the card data
    if (!client.connected()) {
        MQTTreconnect();
    }

    SSDEBUG.println(F("CARD DATA SENT"));
    CheckTime();
    publishRF_ID_Lectura(NodeID,ISO8601,inputString);
    fsm_state = STATE_IDLE; 
    break;
    //**************************************************************************************************STATE_UPDATE*****************************************************
    case STATE_UPDATE:
    SSDEBUG.println(F("STATE_UPDATE"));
    updateDeviceInfo();
    fsm_state = STATE_TRANSMIT_DEVICE_UPDATE;
    break;
    //**************************************************************************************************STATE_TRANSMIT_DEVICE_UPDATE*************************************
    case STATE_TRANSMIT_DEVICE_UPDATE:
    SSDEBUG.println(F("STATE_TRANSMIT_DEVICE_UPDATE"));
    //verificar que el cliente de Conexion al servicio se encuentre conectado
    if (!client.connected()) {
        MQTTreconnect();
    }
    //verificar la hora
    CheckTime();
    publishRF_ID_Manejo(NodeID, msg, VBat, WifiSignal, published, failed, ISO8601, Smacaddrs, Sipaddrs);
    fsm_state = STATE_IDLE;
    break;
    //**************************************************************************************************STATE_TRANSMIT_ALARM_UPDATE**************************************
    case STATE_TRANSMIT_ALARM_UPDATE:
    SSDEBUG.println(F("STATE_TRANSMIT_ALARM_UPDATE"));
    //verificar que el cliente de Conexion al servicio se encuentre conectado
    if (!client.connected()) {
        MQTTreconnect();
    }
    // Verificar la hora
    CheckTime();
    publishRF_ID_Manejo(NodeID,msg, VBat, WifiSignal, published, failed, ISO8601, Smacaddrs, Sipaddrs);
    break;
    //**************************************************************************************************STATE_UPDATE_TIME************************************************
    case STATE_UPDATE_TIME:
    SSDEBUG.println(F("Starting UDP"));
    udp.begin(localPort);
    SSDEBUG.print(("Local port: "));
    SSDEBUG.println(udp.localPort());
    while (NTP == false) {
        setSyncProvider(getNtpTime);                                                                    //iniciamos la mensajeria de UDP para consultar la hora en el servicio de NTP remoto (el servidor se configura en 
        delay(UInterval);
    }                                                                                                   //Cuando fue actualizada la hora del reloj
    NTP = false;
    fsm_state = STATE_IDLE; 
    break;
    }
    yield();
}